<?php include_once("header.php");
session_destroy();
?>

    <div class="mypadding" style="text-align: justify">

        <div class="h1" style="text-align: center">
            Виведення тексту на екран. Оператор echo.
        </div>
        <div>
            <p>
                Коли потрібно відобразити текст на веб-сторінці, то оператор echo є найбільш вживаним оператором в PHP.
                Щоб його використовувати - після слова echo потрібно помістити рядок тексту в лапки:
            </p>
            <code>
                &lt;?php echo 'Привіт від PHP'; ?>
            </code>
            <p>
                Відображення в браузері:
            </p>
            <blockquote>
                Привіт від PHP
            </blockquote>
            <p>
                Для відображення тексту можна використовувати як подвійні лапки, так і одинарні.
                Для чисел лапки можна не використовувати:
            </p>
            <code>
                &lt;?php
                echo 2016;
                ?>
            </code>
            <p>
                Оператор echo також може брати участь у форматуванні веб-сторінки:
            </p>
            <code>
                &lt;?php echo 'Петров Іван&lt;br>
                Родився&lt;br>
                ...';
                ?>
            </code>
            <p>
                Відображення в браузері:
            </p>
            <blockquote>
                Петров Іван<br>
                Народився<br>
                ...
            </blockquote>
        </div>

        <div class="h1" style="text-align: center">
            Синтаксис HEREDOC
        </div>
        <div>
            <p>
            Для відображення великої кількості тексту використовують синтаксис heredoc. Він починається з
            символів <<< , після яких може бути записаний довільний ідентифікатор. Після наявного тексту варто вказати
            той самий ідентифікатор, що і на початку коду:
            </p>
            <code>
                &lt;?php<br>
                echo <<<&lt;END<br>
                Для відображения більшої &lt;br><br>
                кількості тексту використовують &lt;br><br>
                синтаксис heredoc&lt
                END;<br>
                ?>
            </code>
            <p>
                Відображення в браузері:
            </p>
            <blockquote>
                Для відображення більшої<br>
                кількості тексту використовують<br>
                синтаксис heredoc
            </blockquote>
        </div>

        <div class="h1" style="text-align: center">
            Коментарі в скриптах
        </div>
        <div>
            <p>
                Коментарі потрібні для опису написаного скрипта. Вони потрібні, якщо скрипт розробляється довгий час,
                або розробляється кількома особами, в такому випадку неможливо запам'ятати всю структуру програми
                не залишаючи опис в коментарях.
            </p>
            <p>
                У PHP існує 3 типи коментарів.
            </p>
            <p><b>Перший</b> дозволяє розміщувати коментарі в декількох рядках. Починається такий тип коментарів з
                символів /*і закінчуються */, наприклад:
            </p>
            <code>
                &lt;?php<br>
                /* Тут може бути розміщений будь-який текст,<br>
                навіть в декількох рядках */<br>
                ?>
            </code>
            <p>
                Слід мати на увазі, що вкладені коментарі не припустимі. Такий код викличе помилку:
            </p>
            <code>
                &lt;?php<br>
                /* Тут може бути розміщений будь-який текст, <br>
                /* навіть в */<br>
                декількох рядках */<br>
                ?>
            </code>
            <p>
                Наступні два типи є однорядковими. Такі коментарі починаються з символів //або # і тривають до кінця
                рядка. Наприклад:
            </p>
            <code>
                &lt;?php<br>
                // Тут може бути розміщений будь-який текст<br>
                # Тільки в одному рядку!<br>
                echo "Привіт всім !";<br>
                ?>
            </code>
        </div>

        <div class="row-fluid" style="text-align: center">
            <div class="span12">
                <div class="row-fluid">

                    <div class="span6 btn btn-link">
                        <a href="tutorialFirst.php">
                            <button type="button">
                                <span class="glyphicon glyphicon-arrow-left"></span> Попередня сторінка
                            </button>
                        </a>
                    </div>

                    <div class="span6 btn btn-link">
                        <a href="variables.php">
                            <button type="button" >
                                Наступна сторінка <span class="glyphicon glyphicon-arrow-right"></span>
                            </button>
                        </a>
                    </div>

                </div>
            </div>
        </div>

    </div>

<?php include_once("footer.php");