<?php include_once("header.php");
session_destroy();
?>

    <div class="mypadding" style="text-align: justify">

        <div class="h1" style="text-align: center">
            Введення в ОПП
        </div>
        <div>
            <p>
                ООП має вже більш ніж сорокарічну історію, але, незважаючи на це,
                до цих пір не існує чіткого загальноприйнятого визначення даної технології.
                Основні принципи, закладені в перші об'єктні мови і системи, зазнали істотної зміни
                (або спотворення) і доповнення при численних реалізаціях наступних часів.
            </p>
            <div class="h2" style="text-align: center">
                Основні терміни і поняття
            </div>
            <p>
                ООП розшифровується як об'єктно-орієнтоване програмування. Це парадигма (сукупність ідей і понять)
                програмування, в якій основними концепціями є поняття об'єктів і класів.
            </p>
            <p>
                <b>Абстракція</b> - абстрагування, це спосіб опису загальних характеристик об'єкта.
            </p>
            <p>
                <b>Інкапсуляція</b> - це властивість системи, що дозволяє об'єднати дані і методи, що працюють з
                ними, в класі, і приховати деталі реалізації від користувача.
            </p>
            <p>
                <b>Спадкування</b> - властивість системи, що дозволяє описати новий клас на основі вже існуючого з
                частково або повністю запозичує функціональністю. Клас, від якого виробляється
                спадкування, називається базовим, батьківським. Новий клас - нащадком або дочірнім класом.
            </p>
            <p>
                <b>Поліморфізм</b> - це властивість системи використовувати об'єкти з однаковим інтерфейсом без
                інформації про тип і внутрішню структуру об'єкта.
            </p>

        </div>


        <div class="row-fluid" style="text-align: center">
            <div class="span12">
                <div class="row-fluid">

                    <div class="span6 btn btn-link">
                        <a href="phpAndHTML.php">
                            <button type="button">
                                <span class="glyphicon glyphicon-arrow-left"></span> Попередня сторінка
                            </button>
                        </a>
                    </div>

                    <div class="span6 btn btn-link">
                        <a href="phpTheRigthWay.php">
                            <button type="button" >
                                Наступна сторінка <span class="glyphicon glyphicon-arrow-right"></span>
                            </button>
                        </a>
                    </div>

                </div>
            </div>
        </div>

    </div>

<?php include_once("footer.php");